package main

//	"github.com/tamura2004/nobugo/ui"

func ExampleSamuraiTable() {
	//	s := NewSamuraiDeck()[:6]
	//	Table(s)
	// Output:
	//+-------+--------------+------------+
	//| 種別  |     名前     |    能力    |
	//+-------+--------------+------------+
	//| 武将: | 木下藤吉郎   | [3/4 -> 1] |
	//| 武将: | 明智光秀     | [5/6 -> 1] |
	//| 武将: | 柴田勝家     | [3/4 -> 5] |
	//| 武将: | 前田利家     | [5/6 -> 3] |
	//| 武将: | 滝川一益     | [1/2 -> 4] |
	//| 武将: | 弥助         | [1/2 -> 6] |
	//| 武将: | 毛利元就     | [5/6 -> 4] |
	//| 武将: | 徳川家康     | [3/4 -> 2] |
	//| 武将: | 今川義元     | [5/6 -> 1] |
	//| 武将: | 北条氏康     | [1/2 -> 3] |
	//| 武将: | 島津義弘     | [3/4 -> 6] |
	//| 武将: | 松永久秀     | 交換：武将 |
	//| 武将: | 武田信玄     | 兵糧＋1Ｄ  |
	//| 武将: | 上杉謙信     | 合戦＋2Ｄ  |
	//| 武将: | 伊達政宗     | 東4        |
	//| 武将: | 九鬼義隆     | 東6        |
	//| 武将: | 伊藤マンショ | 西6        |
	//| 武将: | 足利義昭     | 1 -> X     |
	//| 武将: | 大友宗麟     | 西4        |
	//+-------+--------------+------------+
}
