cs = [
	["羅馬", "法王庁", 1, 1, 1, "西6"],
	["天竺", "東インド会社", 2, 3, 0, "西5"],
	["唐", "万里の長城", 6, 0, 0, "西5"],
	["琉球", "首里城", 2, 0, 0, "西4"],
	["薩摩", "鹿児島城", 5, 0, 0, "西4"],
	["土佐", "高知城", 5, 0, 0, "西3"],
	["出雲", "出雲大社", 1, 1, 0, "西3"],
	["備前", "岡山城", 2, 0, 0, "西2"],
	["播磨", "姫路城", 3, 4, 0, "西2"],
	["河内", "石山本願寺", 5, 0, 0, "西1"],
	["大和", "東大寺", 1, 1, 0, "西1"],
	["山城", "二条城", 1, 1, 1, "西1"],
	["美濃", "稲葉山城", 5, 0, 0, "東1"],
	["三河", "岡崎城", 2, 0, 0, "東1"],
	["尾張", "名古屋城", 4, 0, 0, "東1"],
	["駿河", "駿府城", 3, 0, 0, "東2"],
	["相模", "小田原城", 2, 3, 4, "東2"],
	["甲斐", "躑躅ヶ崎館", 5, 0, 0, "東2"],
	["越後", "春日山城", 2, 3, 0, "東3"],
	["武蔵", "江戸城", 3, 4, 0, "東3"],
	["出羽", "米沢城", 3, 0, 0, "東4"],
	["蝦夷", "五稜郭", 5, 0, 0, "東4"],
	["桜面戸", "金門橋", 1, 1, 0, "東5"],
	["紐育", "萬八端島", 3, 4, 5, "東6"],
]

cs.each do |c|
	df = []
	[2,3,4].each do |i|
		if c[i] != 0
			df << c[i]
		end
	end
	puts <<"EOD"
[[Castle]]
Area = "#{c[5]}"
Country = "#{c[0]}"
Name = "#{c[1]}"
Defence = #{df.inspect}

EOD
end
